
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокФорматов = Элементы.ВариантЗагрузки.СписокВыбора;
	СписокФорматов.Добавить(1, "РАЙФФАЙЗЕНБАНК");
	СписокФорматов.Добавить(2, "АЛЬФАБАНК");
	СписокФорматов.Добавить(3, "СБЕРБАНК");
	СписокФорматов.Добавить(4, "ПРОМСВЯЗЬБАНК");
	СписокФорматов.Добавить(5, "ПСБ ФАКТОРИНГ");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, НомерСтроки, НомерКолонки, ТипЗначения = "Строка")
	
	НомерСтрокиСтрока = Формат(НомерСтроки, "ЧГ=0;");
	НомерКолонкиСтрока = Формат(НомерКолонки, "ЧГ=0;");
	
	ШаблонАдресаОбласти = НСтр("ru = 'R%1C%2'");
	АдресОбласти = СтрШаблон(ШаблонАдресаОбласти, НомерСтрокиСтрока, НомерКолонкиСтрока);
	
	ОбластьДокумента = ТабличныйДокумент.ПолучитьОбласть(АдресОбласти);
	ЗначениеОбласти = ОбластьДокумента.ТекущаяОбласть.Текст;
	
	Если ТипЗначения = "Число" Тогда
		ЗначениеОбласти = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЗначениеОбласти);
	Иначе
		ЗначениеОбласти = СокрЛП(ЗначениеОбласти);
	КонецЕсли;
	
	Возврат ЗначениеОбласти;
	
КонецФункции

&НаСервере
Функция ПрочитатьТабличныйДокумент(АдресФайла)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	ДанныеФайла.Записать(ИмяВременногоФайла);
	
	Попытка
		ТабличныйДокумент.Прочитать(ИмяВременногоФайла);
	Исключение
		ШаблонОшибки = НСтр("ru = 'Ошибка чтения файла загрузки: %1'");
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ФайлФинансирование");
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		Возврат Истина;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();
	Объект.ПлатежныеПозицииФинансирование.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ФакторПриИзменении(Элемент)
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();
	Объект.ПлатежныеПозицииФинансирование.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого Стр Из Объект.ДокументыОплаты Цикл
		Стр.Выбран = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыбор(Команда)
	Для Каждого Стр Из Объект.ДокументыОплаты Цикл
		Стр.Выбран = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ФайлФинансированиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр						=	"Файл протокола обмена (*.xls*)|*.xls*";
	ДиалогВыбораФайла.Расширение					=	"xlsx";	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	ФайлФинансирование;	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ФайлФинансирование = ДиалогВыбораФайла.ПолноеИмяФайла;				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлОстаткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр						=	"Файл протокола обмена (*.xls*)|*.xls*";
	ДиалогВыбораФайла.Расширение					=	"xlsx";	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	ФайлОстатки;	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ФайлОстатки = ДиалогВыбораФайла.ПолноеИмяФайла;				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФинансирование(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Вариант = Объект.ВариантЗагрузки;
	
	Если Вариант = 1 Тогда		 //Райффайзен
		ПрочитатьЛистExcel_Финансирование_Райффайзен();
		ЗагрузитьФинансированиеНаСервере();
	ИначеЕсли Вариант = 2 Тогда	 //Альфа
		ПрочитатьЛистExcel_Финансирование_Альфа();
		ЗагрузитьФинансированиеНаСервере();
	ИначеЕсли Вариант = 3 Тогда  //Сбербанк
		ПрочитатьЛистExcel_Финансирование_Сбербанк();
		ЗагрузитьФинансированиеНаСервере();
	ИначеЕсли Вариант = 4 Тогда  //Промсвязьбанк
		ПрочитатьЛистExcel_Финансирование_ПромСвязьБанк();
	ИначеЕсли Вариант = 5 Тогда  //ПСБ Факторинг
		ПрочитатьЛистExcel_Финансирование_ПСБФакторинг();
	Иначе
		Сообщить("Загрузка данных для выбранного варианта не предусмотрена!");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьФинансированиеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиФайлаНаСервер(Результат, АдресФайла, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не ПрочитатьТабличныйДокумент(АдресФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ПерваяСтрока = 12;
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	Объект.ПлатежныеПозицииФинансирование.Очистить();
	
	Для ТекущаяСтрока = ПерваяСтрока По КоличествоСтрок Цикл
		СуммаФинансирования = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 12, "Число");
		Если Не ЗначениеЗаполнено(СуммаФинансирования) Тогда
			Продолжить;
		КонецЕсли;
		
		// Получим дату платежа
		ДатаПлатежа = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 16);
		Если Не ЗначениеЗаполнено(ДатаПлатежа) Тогда
			ДатаПлатежа = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 11);
		КонецЕсли;
		
		ДатаПлатежа = ПолучитьФорматДаты(ДатаПлатежа);
		Если Год(ДатаПлатежа) < 2000 Тогда
			ДатаПлатежа = ДобавитьМесяц(ДатаПлатежа, 2000*12);
		КонецЕсли;
		
		// Получим дату поставки
		ДатаПоставки = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 4);
		Если Не ЗначениеЗаполнено(ДатаПоставки) Тогда
			ДатаПоставки = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 7);
		КонецЕсли;
		
		ДатаПоставки = ПолучитьФорматДаты(ДатаПоставки);
		
		// Получим номер поставки
		НомерПоставки = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 3);
		
		НоваяСтрока = Объект.ПлатежныеПозицииФинансирование.Добавить();
		НоваяСтрока.ДатаПлатежа = ДатаПлатежа;
		НоваяСтрока.ДатаПоставки = ДатаПоставки;
		НоваяСтрока.НомерПоставки = НомерПоставки;
		НоваяСтрока.Сумма = СуммаФинансирования;
		НоваяСтрока.СуммаПП = СуммаФинансирования;
	КонецЦикла;
	
	ЗагрузитьФинансированиеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel_Финансирование_ПромСвязьБанк()
	
	Если Не ЗначениеЗаполнено(ФайлФинансирование) Тогда
		ТекстОшибки = НСтр("ru = 'Укажите путь к файлу!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ФайлФинансирование");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайлаНаСервер", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения, , ФайлФинансирование, Ложь, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЛистExcel_Финансирование_ПСБФакторинг()
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel_Финансирование_Сбербанк()
	
	Если Не ЗначениеЗаполнено(ФайлФинансирование) Тогда
		ТекстОшибки = НСтр("ru = 'Укажите путь к файлу!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ФайлФинансирование");
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлФинансирование);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 3;		
	Объект.ПлатежныеПозицииФинансирование.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 10).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииФинансирование.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 15).Value),Символы.НПП,""));  //11
		НоваяСтр.НомерПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 16).Value),Символы.НПП,"")); //12
		
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 11).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 10).Value),Символы.НПП,"")); //6
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 11).Value),Символы.НПП,"")); //7
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 14).Value),Символы.НПП,""));   //10
		НоваяСтр.СуммаПП =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 14).Value),Символы.НПП,"")); //10
		
		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel_Финансирование_Райффайзен()
	
	Если Не ЗначениеЗаполнено(ФайлФинансирование) Тогда
		ТекстОшибки = НСтр("ru = 'Укажите путь к файлу!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ФайлФинансирование");
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлФинансирование);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 12;		
	Объект.ПлатежныеПозицииФинансирование.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииФинансирование.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 16).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 16).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,""));
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 8).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 8).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 15).Value),Символы.НПП,""));
		НоваяСтр.СуммаПП =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 19).Value),Символы.НПП,""));
		
		Сч=Сч+1;
	КонецЦикла;	
	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel_Финансирование_Альфа()
	
	Если Не ЗначениеЗаполнено(ФайлФинансирование) Тогда
		ТекстОшибки = НСтр("ru = 'Укажите путь к файлу!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ФайлФинансирование");
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлФинансирование);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 5;		
	Объект.ПлатежныеПозицииФинансирование.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 2).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииФинансирование.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 2).Value),Символы.НПП,""));
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 1).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 1).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 6).Value),Символы.НПП,""));
		
		Сч=Сч+1;
	КонецЦикла;	
	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel_Остатки_Райффайзен()
	
	Если Не ЗначениеЗаполнено(ФайлОстатки) Тогда
		ТекстОшибки = НСтр("ru = 'Укажите путь к файлу!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ФайлОстатки");
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлОстатки);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 11;		
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 13).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииПеречислениеОстатков.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 23).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 23).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 13).Value),Символы.НПП,""));
		
		
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч,14).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 14).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 22).Value),Символы.НПП,""));
		НоваяСтр.СуммаПП =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 26).Value),Символы.НПП,""));

		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel_Остатки_Альфа()
	
	Если Не ЗначениеЗаполнено(ФайлОстатки) Тогда
		ТекстОшибки = НСтр("ru = 'Укажите путь к файлу!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ФайлОстатки");
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлОстатки);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 5;		
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 2).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииПеречислениеОстатков.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 2).Value),Символы.НПП,""));
		НомерПоставки = СтрРазделить(НоваяСтр.НомерПоставки," ",Ложь);
		НоваяСтр.НомерПоставки = НомерПоставки[0];
		
		
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 1).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 1).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 6).Value),Символы.НПП,""));
		
		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel_Остатки_Сбер()
	
	Если Не ЗначениеЗаполнено(ФайлОстатки) Тогда
		ТекстОшибки = НСтр("ru = 'Укажите путь к файлу!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ФайлОстатки");
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлОстатки);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 7;		
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 5).Value),Символы.НПП,""))) Тогда //6
			НоваяСтр = Объект.ПлатежныеПозицииПеречислениеОстатков.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 14).Value),Символы.НПП,""));  //16
		НоваяСтр.НомерПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 15).Value),Символы.НПП,"")); //18
		
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 16).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 4).Value),Символы.НПП,"")); //7,1
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 5).Value),Символы.НПП,"")); //6,2
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 1).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 13).Value),Символы.НПП,""));   //10,15
		НоваяСтр.СуммаПП =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 13).Value),Символы.НПП,"")); //10,15
		
		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФорматДаты(СтрДата)
	СтрДата = СокрЛП(СтрЗаменить(Нрег(СтрДата), ".", ""));
	СтрДата = СокрЛП(СтрЗаменить(Нрег(СтрДата), "г", ""));
	Попытка
		Год = Прав(СтрДата, 4);
		Мес = Сред(СтрДата,3,2); 
		День = Лев(СтрДата, 2);
		Дата = Год + Мес + День;
	Исключение
		Сообщить("Ошибочный формат даты !!!");
		Сообщить(СтрДата);
	КонецПопытки;
	Возврат Дата;
КонецФункции

&НаСервере
Процедура ЗагрузитьФинансированиеНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПлатежныеПозицииФинансирование.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	// Ищем документы РТУ
	// Документов может быть много, поэтому сначала готовим таблицу документов, затем ищем по таблице
	ТаблицаРТУ = ПодготовитьТаблицуРТУ();
	Для Каждого Стр Из Объект.ПлатежныеПозицииФинансирование Цикл
		//Структура = НайтиРТУпоНомеруИзКупца(Стр.НомерПоставки, Стр.ДатаПоставки);
		Структура = НайтиРТУпоТаблице(ТаблицаРТУ, Стр.НомерПоставки, Стр.ДатаПоставки);
		Если Структура = Неопределено Тогда
			Стр.ЕстьОшибки = Истина;
			Продолжить;
		КонецЕсли;
		Стр.РТУ = Структура.РТУ;	
		Стр.СчетФактура = Структура.СчетФактура;
	КонецЦикла;
	ТаблицаРТУ = Неопределено;
	
	// Ищем документы оплат
	Если Объект.ВариантЗагрузки = 5 Тогда
		
		// Заполняем Договор
		ДебиторыДоговоров = ПолучитьДебиторовДоговоровФакторинга();
		Для Каждого Стр Из Объект.ПлатежныеПозицииФинансирование Цикл
			Стр.ДоговорКонтрагента = ДебиторыДоговоров[ВРег(Стр.Дебитор)];
			Если Не ЗначениеЗаполнено(Стр.ДоговорКонтрагента) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не найден договор факторинга для дебитора %1", Стр.Дебитор));
				Стр.ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЦикла;
		
		// Ищем один документ на один день по договору
		ТаблицаДокументов = Объект.ПлатежныеПозицииФинансирование.Выгрузить(
			Новый Структура("ЕстьОшибки", Ложь), "ДатаПлатежа, Дебитор, ДоговорКонтрагента, СуммаПП");
		ТаблицаДокументов.Свернуть("ДатаПлатежа, Дебитор, ДоговорКонтрагента", "СуммаПП");
		
		Для Каждого СтрокаДокументов Из ТаблицаДокументов Цикл
			ПоступлениеРС = НайтиПоступленияНаРСпоСуммеИДоговору(СтрокаДокументов.ДоговорКонтрагента, СтрокаДокументов.СуммаПП, СтрокаДокументов.ДатаПлатежа);
			Если ЗначениеЗаполнено(ПоступлениеРС) Тогда
				ОтборСтрок = Новый Структура("ДатаПлатежа, ДоговорКонтрагента");
				ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаДокументов);
				СтрокиТЧ = Объект.ПлатежныеПозицииФинансирование.НайтиСтроки(ОтборСтрок);
				Для Каждого Стр Из СтрокиТЧ Цикл
					Стр.ПоступлениеРС = ПоступлениеРС;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Для Каждого Стр Из Объект.ПлатежныеПозицииФинансирование Цикл
			Если Объект.ПоискПоКомментариям Тогда
				Стр.ПоступлениеРС = НайтиПоступленияНаРСпоНазначениюПлатежа2(Стр.НомерПоставки, Стр.ДатаПлатежа);
			Иначе
				Стр.ПоступлениеРС = НайтиПоступленияНаРСпоСуммеПП(Стр.НомерПоставки, Стр.СуммаПП, Стр.ДатаПлатежа, Стр.НомерПлатежа);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	// Переносим данные в ТЧ документов оплаты
	
	Объект.ДокументыОплаты.Очистить();
	
	// Используем временную таблицу, чтобы исключить свернуть данные и исключить ошибки
	ТаблицаПоступлений = Объект.ДокументыОплаты.Выгрузить();
	Для Каждого Стр Из Объект.ПлатежныеПозицииФинансирование Цикл
		Если ЗначениеЗаполнено(Стр.РТУ) И ЗначениеЗаполнено(Стр.ПоступлениеРС) Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаПоступлений.Добавить(), Стр);
		КонецЕсли;
	КонецЦикла;
	ТаблицаПоступлений.Свернуть("ПоступлениеРС, ДатаПлатежа", "Сумма");
	
	Для Каждого Стр Из ТаблицаПоступлений Цикл
		СтрокаОплат = Объект.ДокументыОплаты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОплат, Стр);
		Если Стр.Сумма <> Стр.ПоступлениеРС.СуммаДокумента Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон("Не совпадает сумма по данным фактора (%1) и документа оплаты %2 (%3)", 
					Стр.Сумма, Стр.ПоступлениеРС, Стр.ПоступлениеРС.СуммаДокумента), , 
				СтрШаблон("Объект.ДокументыОплаты[%1].Сумма", СтрокаОплат.НомерСтроки - 1));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФинансирование(Команда)
	СохранитьФинансированиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьФинансированиеНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПлатежныеПозицииФинансирование.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.13");
	СтруктураПоиска = Новый Структура("ПоступлениеРС, ДатаПлатежа");
	
	НачатьТранзакцию();
	
	Попытка
		Для Каждого СтрРеестр Из Объект.ДокументыОплаты Цикл
			Если Не СтрРеестр.Выбран Тогда
				Продолжить;
			КонецЕсли;
			
			Если Ложь Тогда
				ДокОб = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрРеестр);
			ДокОб = СтрРеестр.ПоступлениеРС.ПолучитьОбъект();
			РасшифровкаПлатежа = ДокОб.РасшифровкаПлатежа;
			
			Если РасшифровкаПлатежа.Количество() > 0 Тогда
				мАналитикаБДДС1= РасшифровкаПлатежа[0].АналитикаБДДС1;
				мЦФО = РасшифровкаПлатежа[0].ЦФО;
				мПроект = РасшифровкаПлатежа[0].Проект;
			Иначе
				мАналитикаБДДС1 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
				мЦФО = Справочники.Организации.ПустаяСсылка();
				мПроект = Справочники.Проекты.ПустаяСсылка();
			КонецЕсли;
			
			РасшифровкаПлатежа.Очистить();
			ДанныеИзРеестра = Объект.ПлатежныеПозицииФинансирование.НайтиСтроки(СтруктураПоиска);
			ТЧ.Очистить();
			
			Для Каждого Стр Из ДанныеИзРеестра Цикл
				ЗаполнитьЗначенияСвойств(ТЧ.Добавить(), Стр);
			КонецЦикла;
			
			Если Не ТребуетсяИзменениеДокумента(ТЧ,СтрРеестр.ПоступлениеРС) Тогда
				Сообщить("Переформирован документ "+Строка(СтрРеестр.ПоступлениеРС));
			КонецЕсли;
			
			Для Каждого Стр Из Объект.ПлатежныеПозицииФинансирование.НайтиСтроки(СтруктураПоиска) Цикл
				НоваяСтр = РасшифровкаПлатежа.Добавить();
				НоваяСтр.ДоговорКонтрагента = ДокОб.ДоговорКонтрагента;
				НоваяСтр.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
				НоваяСтр.СуммаПлатежа = Стр.Сумма;
				НоваяСтр.СуммаВзаиморасчетов = НоваяСтр.СуммаПлатежа;
				НоваяСтр.КурсВзаиморасчетов = 1;
				НоваяСтр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;	// НДС не нужен по счету 76.13 //Репин 29/08/2019
				НоваяСтр.СтатьяДвиженияДенежныхСредств = ДокОб.СтатьяДвиженияДенежныхСредств;
				НоваяСтр.КратностьВзаиморасчетов = 1;
				НоваяСтр.КурсНаДатуПриобретенияРеализацииВалюты = 1;
				НоваяСтр.СчетУчетаРасчетовСКонтрагентом = СчетУчетаРасчетовСКонтрагентом;
				НоваяСтр.сакс_ДокументРеализации = Стр.РТУ;
				//НоваяСтр.ДоговорКонтрагента = НайтиДоговор(Стр.РТУ); // Скоков 09.11.2020. Договор заполняется из шаблона назначения платежа
				НоваяСтр.ЦФО = мЦФО;
				НоваяСтр.Проект= мПроект;
				НоваяСтр.АналитикаБДДС1 = мАналитикаБДДС1;
			КонецЦикла;
			
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить(Строка(ДокОб.Ссылка));
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОстатки(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Вариант = Объект.ВариантЗагрузки;
	Если Вариант = 1 Тогда		 //Райффайзен
		ПрочитатьЛистExcel_Остатки_Райффайзен();
	ИначеЕсли Вариант = 2 Тогда	 //Альфа
		ПрочитатьЛистExcel_Остатки_Альфа();
	ИначеЕсли Вариант = 3 Тогда  //Сбербанк
		ПрочитатьЛистExcel_Остатки_Сбер();
	Иначе
		Сообщить("Загрузка данных для выбранного варианта не предусмотрена!");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОстаткиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОстаткиНаСервере()
	Для Каждого  Стр Из  Объект.ПлатежныеПозицииПеречислениеОстатков Цикл
		Структура = НайтиРТУпоНомеруИзКупца(Стр.НомерПоставки,Стр.ДатаПоставки);
		Если Структура <> Неопределено Тогда
			Стр.РТУ = Структура.РТУ;	
			Стр.СчетФактура = Структура.СчетФактура;
		Иначе
			ЕстьОшибки = Истина;
			Сообщить("Документ реализации " + Стр.НомерПоставки+" от "+Формат(Стр.ДатаПоставки,"ДФ=dd.MM.yyyy")+" не найден!");
		КонецЕсли;
		Если Объект.ПоискПоКомментариям Тогда
   			Стр.ПоступлениеРС = НайтиПоступленияНаРСпоНазначениюПлатежа2(Стр.НомерПоставки,Стр.ДатаПлатежа,Истина);
		Иначе	
			Стр.ПоступлениеРС = НайтиПоступленияНаРСпоСуммеПП(Стр.НомерПоставки,Стр.СуммаПП,Стр.ДатаПлатежа,Стр.НомерПлатежа,Истина);
		КонецЕсли;	
	КонецЦикла;	
	Объект.ДокументыОплаты.Очистить();
	
	Для каждого Стр Из Объект.ПлатежныеПозицииПеречислениеОстатков Цикл
		Если Стр.РТУ = Документы.РеализацияТоваровУслуг.ПустаяСсылка() или
			Стр.ПоступлениеРС = Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект.ДокументыОплаты.Добавить(),Стр);
	КонецЦикла;
	ВрТаб = Объект.ДокументыОплаты.Выгрузить();
	
	ВрТаб.Свернуть("Выбран,ПоступлениеРС,ДатаПлатежа","Сумма");
	Объект.ДокументыОплаты.Очистить();
	Для каждого стр Из ВрТаб Цикл
		Если Стр.Сумма = Стр.ПоступлениеРС.СуммаДокумента Тогда
			ЗаполнитьЗначенияСвойств(Объект.ДокументыОплаты.Добавить(),Стр);
		КонецЕсли;
	КонецЦикла;
	ВрТаб = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОстатки(Команда)
	СохранитьОстаткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьОстаткиНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПлатежныеПозицииПеречислениеОстатков.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.13");
	СтруктураПоиска = Новый Структура("ПоступлениеРС, ДатаПлатежа");
	
	НачатьТранзакцию();
	
	Попытка
		Для Каждого СтрРеестр Из Объект.ДокументыОплаты Цикл
			Если Не СтрРеестр.Выбран Тогда
				Продолжить;
			КонецЕсли;
			
			Если Ложь Тогда
				ДокОб = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрРеестр);
			ДокОб = СтрРеестр.ПоступлениеРС.ПолучитьОбъект();
			РасшифровкаПлатежа = ДокОб.РасшифровкаПлатежа;
			
			Если РасшифровкаПлатежа.Количество() > 0 Тогда
				мАналитикаБДДС1= РасшифровкаПлатежа[0].АналитикаБДДС1;
				мЦФО = РасшифровкаПлатежа[0].ЦФО;
				мПроект = РасшифровкаПлатежа[0].Проект;
			Иначе
				мАналитикаБДДС1 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
				мЦФО = Справочники.Организации.ПустаяСсылка();
				мПроект = Справочники.Проекты.ПустаяСсылка();
			КонецЕсли;
			
			РасшифровкаПлатежа.Очистить();
			ДанныеИзРеестра = Объект.ПлатежныеПозицииПеречислениеОстатков.НайтиСтроки(СтруктураПоиска);
			ТЧ.Очистить();
			
			Для Каждого Стр Из ДанныеИзРеестра Цикл
				ЗаполнитьЗначенияСвойств(ТЧ.Добавить(),Стр);
			КонецЦикла;
			
			Если Не ТребуетсяИзменениеДокумента(ТЧ, СтрРеестр.ПоступлениеРС) Тогда
				Сообщить("Переформирован документ " + Строка(СтрРеестр.ПоступлениеРС));
			КонецЕсли;
			
			Для Каждого Стр Из Объект.ПлатежныеПозицииПеречислениеОстатков.НайтиСтроки(СтруктураПоиска) Цикл
				НоваяСтр = РасшифровкаПлатежа.Добавить();
				НоваяСтр.ДоговорКонтрагента = ДокОб.ДоговорКонтрагента;
				НоваяСтр.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
				НоваяСтр.СуммаПлатежа = Стр.Сумма;
				НоваяСтр.СуммаВзаиморасчетов = НоваяСтр.СуммаПлатежа;
				НоваяСтр.КурсВзаиморасчетов = 1;
				НоваяСтр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС; // НДС не нужен по счету 76.13 //Репин 29/08/2019
				НоваяСтр.СтатьяДвиженияДенежныхСредств = ДокОб.СтатьяДвиженияДенежныхСредств;
				НоваяСтр.КратностьВзаиморасчетов = 1;
				НоваяСтр.КурсНаДатуПриобретенияРеализацииВалюты = 1;
				НоваяСтр.СчетУчетаРасчетовСКонтрагентом = СчетУчетаРасчетовСКонтрагентом;
				НоваяСтр.сакс_ДокументРеализации = Стр.РТУ;
				//НоваяСтр.ДоговорКонтрагента = НайтиДоговор(Стр.РТУ); // Скоков 09.11.2020. Договор заполняется из шаблона назначения платежа
				НоваяСтр.ЦФО = мЦФО;
				НоваяСтр.Проект = мПроект;
				НоваяСтр.АналитикаБДДС1 = мАналитикаБДДС1;	
			КонецЦикла;
			
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить(Строка(ДокОб.Ссылка));
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		//Объект.ПлатежныеПозицииФинансирование.Очистить();
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки		
	
КонецПроцедуры

&НаСервере
Функция НайтиРТУпоНомеруИзКупца(НомерПоставки, ДатаПоставки)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК РТУ,
	|	СчетФактураВыданный.Ссылка КАК СчетФактура
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка)
	|			И (СчетФактураВыданный.Проведен)
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.Сакс_НомерИзКупца = &Сакс_НомерИзКупца";
	
	Запрос.УстановитьПараметр("Сакс_НомерИзКупца", НомерПоставки);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДобавитьМесяц(ДатаПоставки, -1)));
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДобавитьМесяц(ДатаПоставки, 1)));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Структура = Новый Структура("РТУ,СчетФактура");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура, ВыборкаДетальныеЗаписи);
		Возврат Структура;
	КонецЦикла;
	
	Возврат Неопределено;	
КонецФункции

&НаСервере
Функция ПодготовитьТаблицуРТУ()
	
	// Определяем диапазон дат
	ТаблицаДат = Объект.ПлатежныеПозицииФинансирование.Выгрузить( , "ДатаПоставки");
	ТаблицаДат.Свернуть("ДатаПоставки");
	ТаблицаДат.Сортировать("ДатаПоставки");
	ДатаНачала = ТаблицаДат[0].ДатаПоставки;
	ДатаОкончания = ТаблицаДат[ТаблицаДат.Количество() - 1].ДатаПоставки;
	Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		Сообщить("В некоторых строках не заполнена Дата поставки!");
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Сакс_НомерИзКупца КАК НомерИзКупца,
	|	РеализацияТоваровУслуг.Ссылка КАК РТУ,
	|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) КАК ДатаРТУ,
	|	СчетФактураВыданный.Ссылка КАК СчетФактура
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка)
	|			И (СчетФактураВыданный.Проведен)
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерИзКупца";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДобавитьМесяц(ДатаНачала, -1)));
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДобавитьМесяц(ДатаОкончания, 1)));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	ТаблицаРТУ = Запрос.Выполнить().Выгрузить();
	ТаблицаРТУ.Индексы.Добавить("НомерИзКупца");
	Возврат ТаблицаРТУ;

КонецФункции

&НаСервере
Функция НайтиРТУпоТаблице(ТаблицаРТУ, НомерПоставки, ДатаПоставки)
	
	Отбор = Новый Структура("НомерИзКупца", НомерПоставки);
	СтрокиРТУ = ТаблицаРТУ.НайтиСтроки(Отбор);
	Если СтрокиРТУ.Количество() = 1 Тогда
		Возврат СтрокиРТУ[0];
	ИначеЕсли СтрокиРТУ.Количество() > 1 Тогда
		Сообщить(СтрШаблон("Найдено несколько РТУ по номеру %1 от %2", НомерПоставки, Формат(ДатаПоставки, "ДФ=dd.MM.yyyy")));
		Возврат Неопределено;
	Иначе
		Сообщить(СтрШаблон("Не найдена РТУ по номеру %1 от %2", НомерПоставки, Формат(ДатаПоставки, "ДФ=dd.MM.yyyy")));
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьДебиторовДоговоровФакторинга()
	
	// Мы не можем сразу взять данные настройки заолнения,
	// потому что в настройке могут быть договоры разных организаций и контрагентов.
	// Поэтому каждый договор из настройки проверяем, подходит ли он нам.
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Владелец", Объект.Фактор);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СФакторинговойКомпанией);
	ВозможныеДоговоры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	НастройкаЗаполнения = сакс_ОбщегоНазначенияПривилегированный.ПолучитьНастройкуЗаполнения("ДебиторыДоговоровФакторингаСАКС");
	Для Каждого Пара Из НастройкаЗаполнения Цикл
		Если ВозможныеДоговоры.Найти(Пара.Значение) <> Неопределено Тогда
			Результат.Вставить(ВРег(Пара.Ключ), Пара.Значение);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НайтиПоступленияНаРСпоНазначениюПлатежа2(НомерПоставки,ДатаПлатежа,ПеречислениеОстатков = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
	|	ПоступлениеНаРасчетныйСчет.НазначениеПлатежа КАК НазначениеПлатежа
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен
	|	И ПоступлениеНаРасчетныйСчет.ВидОперации = &ВидОперации
	|	И ПоступлениеНаРасчетныйСчет.Контрагент = &Контрагент
	|	И &УсловиеОтбораПоНазначениюПлатежа
	//|	И НАЧАЛОПЕРИОДА(ПоступлениеНаРасчетныйСчет.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата2, МЕСЯЦ)
	|	И ПоступлениеНаРасчетныйСчет.Организация = &Организация";
	
	Если ПеречислениеОстатков Тогда
		НазначениеПлатежа = "%ПЕРЕЧИСЛЕНИЕ ОСТАТКОВ%"+ " "+НомерПоставки+"%"; //06.05.19 добавлен пробел в строку поиска для исключения двойных нахождений номер Репин
		НазначениеПлатежа2 = "%Перевод остатка%"+ " "+НомерПоставки+"%";      //06.05.19добавлен пробел в строку поиска  для исключения двойных нахождений номер Репин
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеОтбораПоНазначениюПлатежа",
		"(ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа 
		|ИЛИ ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа2)" );
		
	Иначе
		НазначениеПлатежа = "%Финансирование%"+ " " +НомерПоставки+"%";//06.05.19добавлен пробел в строку поиска  для исключения двойных нахождений номер Репин
		НазначениеПлатежа2 = "%NN%"+ " " +НомерПоставки+"%";//06.05.19добавлен пробел в строку поиска  для исключения двойных нахождений номер Репин
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеОтбораПоНазначениюПлатежа",
		"(ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа
		|ИЛИ ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа2)" );
	КонецЕсли;
	
	//
	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаОтФакторинговойКомпании);
	Запрос.УстановитьПараметр("Контрагент", Объект.Фактор);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НазначениеПлатежа", НазначениеПлатежа);
	Запрос.УстановитьПараметр("НазначениеПлатежа2", НазначениеПлатежа2);
	Запрос.УстановитьПараметр("Дата", ДатаПлатежа);		
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(ДатаПлатежа)+1);		

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ПоступлениеНаРС = Неопределено;
	Ненайден = Истина; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Сообщить(НомерПоставки + " " + ВыборкаДетальныеЗаписи.Ссылка);
		Ненайден = Ложь;
		Если ПоступлениеНаРС <> Неопределено Тогда
			Сообщить("Для поставки "+НомерПоставки+" найдены несколько документов поступления на расчетный счет!");
			Возврат Неопределено;
		Иначе
			ПоступлениеНаРС = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Если  Ненайден Тогда
		сообщить("Не найдено для поставки: " + НомерПоставки);
	КонецЕсли;	

	Возврат ПоступлениеНаРС;	
КонецФункции

&НаСервере
Функция НайтиПоступленияНаРСпоСуммеПП(НомерПоставки,СуммаПП,ДатаПлатежа,НомерПлатежа,ПеречислениеОстатков = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
	|	ПоступлениеНаРасчетныйСчет.НазначениеПлатежа КАК НазначениеПлатежа
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен
	|	И ПоступлениеНаРасчетныйСчет.ВидОперации = &ВидОперации
	|	И ПоступлениеНаРасчетныйСчет.Контрагент = &Контрагент
	|	И ПоступлениеНаРасчетныйСчет.СуммаДокумента = &СуммаПП
	|	И ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоступлениеНаРасчетныйСчет.Организация = &Организация";
	
	Если НомерПлатежа <> "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"ПоступлениеНаРасчетныйСчет.СуммаДокумента = &СуммаПП",
			"ПоступлениеНаРасчетныйСчет.НомерВходящегоДокумента = &НомерПлатежа");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаОтФакторинговойКомпании);
	Запрос.УстановитьПараметр("Контрагент", Объект.Фактор);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НомерПлатежа", НомерПлатежа);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаПлатежа));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаПлатежа));
	Запрос.УстановитьПараметр("СуммаПП", СуммаПП);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДокументов.Количество() = 1 Тогда
		Возврат ТаблицаДокументов[0].Ссылка;
	ИначеЕсли ТаблицаДокументов.Количество() > 1 Тогда
		Сообщить("Для поставки " + НомерПоставки + " найдены несколько документов поступления на расчетный счет!");
		Возврат Неопределено;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиПоступленияНаРСпоСуммеИДоговору(ДоговорКонтрагента, СуммаПП, ДатаПлатежа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен
	|	И ПоступлениеНаРасчетныйСчет.ВидОперации = &ВидОперации
	|	И ПоступлениеНаРасчетныйСчет.Организация = &Организация
	|	И ПоступлениеНаРасчетныйСчет.Контрагент = &Контрагент
	|	И ПоступлениеНаРасчетныйСчет.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И ПоступлениеНаРасчетныйСчет.СуммаДокумента = &СуммаПП
	|	И ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаОтФакторинговойКомпании);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Фактор);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("СуммаПП", СуммаПП);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ДатаПлатежа));		
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаПлатежа));		
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДокументов.Количество() = 1 Тогда
		Возврат ТаблицаДокументов[0].Ссылка;
	ИначеЕсли ТаблицаДокументов.Количество() > 1 Тогда
		Сообщить("Для договора " + ДоговорКонтрагента + " найдены несколько документов поступления на расчетный счет!");
		Возврат Неопределено;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиДоговор(РТУ)
	
	Контрагент = Рту.Контрагент;
	Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Если      Контрагент.Код = "УХ-000162" Тогда //Агроторг
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054676");
	ИначеЕсли Контрагент.Код = "УХ-000215" Тогда //ГиперГлобус
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054679");
	ИначеЕсли Контрагент.Код = "УХ-000257" Тогда //Копейка-Москва
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054675");
	ИначеЕсли Контрагент.Код = "УХ-000380" Тогда //Перекресток
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054678");
	ИначеЕсли Контрагент.Код = "УХ-000762" Тогда //СладкаяЖизнь
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054677");
	ИначеЕсли Контрагент.Код = "УХ-000181" Тогда //Атак
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-055803");
	ИначеЕсли Контрагент.Код = "УХ-000183" Тогда //Ашан
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054644");
	ИначеЕсли Контрагент.Код = "УХ-004550" Тогда //Метро
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054680");
	ИначеЕсли Контрагент.Код = "УХ-004559" Тогда //О"КЕЙ
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-057301");
	ИначеЕсли Контрагент.Код = "УХ-025647" Тогда //Лента
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-056556");
	ИначеЕсли Контрагент.Код = "УХ-004486" Тогда //Тандер
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-057302");		
	КонецЕсли;	
	
	Возврат Договор;
	
КонецФункции

&НаСервере
Функция ТребуетсяИзменениеДокумента(ДанныеИзРеестра,Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.сакс_ДокументРеализации КАК сакс_ДокументРеализации,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа
	|ПОМЕСТИТЬ ДанныеИзДокумента
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеИзРеестра.РТУ КАК РТУ,
	|	ДанныеИзРеестра.Сумма КАК Сумма
	|ПОМЕСТИТЬ ДанныеИзРеестра
	|ИЗ
	|	&ДанныеИзРеестра КАК ДанныеИзРеестра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеИзДокумента.сакс_ДокументРеализации КАК сакс_ДокументРеализации,
	|	ДанныеИзДокумента.СуммаПлатежа КАК СуммаПлатежа,
	|	ДанныеИзРеестра.Сумма КАК Сумма
	|ИЗ
	|	ДанныеИзРеестра КАК ДанныеИзРеестра
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеИзДокумента КАК ДанныеИзДокумента
	|		ПО ДанныеИзРеестра.РТУ = ДанныеИзДокумента.сакс_ДокументРеализации
	|ГДЕ
	|	ДанныеИзРеестра.Сумма <> ЕСТЬNULL(ДанныеИзДокумента.СуммаПлатежа, 0)";
	
	Запрос.Параметры.Вставить("Ссылка",Документ);
	Запрос.Параметры.Вставить("ДанныеИзРеестра",ДанныеИзРеестра.Выгрузить(,"РТУ,СУММА"));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНомераПостуленийНаРС(Команда)
	ПараметрыФ = Новый Структура();
	Параметрыф.Вставить("Организация",Объект.Организация);
	Параметрыф.Вставить("Контрагент",Объект.Фактор);
	ПараметрыФ.Вставить("ОткудаВызов",Элементы.Группа8.ТекущаяСтраница.Заголовок);
	ОткрытьФормуМодально("ВнешняяОбработка.РаспределениеФакторинга.Форма.ФормаЗагрузкиСоответствия",Параметрыф,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Загрузка данных" Тогда	
		ТЧ2.Очистить();
		Для Каждого Стр Из Параметр.Данные Цикл
			ЗаполнитьЗначенияСвойств(ТЧ2.Добавить(),Стр);
		КонецЦикла;
		Если Параметр.ОткудаВызов = "Финансирование" Тогда
			ОбновитьСписокДокументов("ПлатежныеПозицииФинансирование");
		Иначе
			ОбновитьСписокДокументов("ПлатежныеПозицииПеречислениеОстатков");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокДокументов(Таблица)
	
	Если ТЧ2.Количество() > 0 Тогда
		Для каждого Стр Из Объект[Таблица].НайтиСтроки(Новый Структура("ПоступлениеРС", Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка())) Цикл
			Соответствия  = Тч2.НайтиСтроки(Новый Структура("Реализация",Стр.РТУ));
			Если Соответствия.Количество() > 0 Тогда
				 Стр.ПоступлениеРС = Соответствия[0].ПоступлениеРС;
			КонецЕсли;			
		КонецЦикла;
		
		Объект.ДокументыОплаты.Очистить();
		
		Для каждого Стр Из Объект[Таблица] Цикл
			Если Стр.РТУ = Документы.РеализацияТоваровУслуг.ПустаяСсылка() или
				Стр.ПоступлениеРС = Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка() Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Объект.ДокументыОплаты.Добавить(),Стр);
		КонецЦикла;
		ВрТаб = Объект.ДокументыОплаты.Выгрузить();
		
		ВрТаб.Свернуть("Выбран,ПоступлениеРС,ДатаПлатежа","Сумма");
		Объект.ДокументыОплаты.Очистить();
		Для Каждого Стр Из ВрТаб Цикл
			Если Стр.Сумма = Стр.ПоступлениеРС.СуммаДокумента Тогда
				ЗаполнитьЗначенияСвойств(Объект.ДокументыОплаты.Добавить(),Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	
