// 10, 21, 132

&НаСервере
Функция ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, НомерСтроки, НомерКолонки, ТипЗначения = "Строка")
	
	НомерСтрокиСтрока = Формат(НомерСтроки, "ЧГ=0;");
	НомерКолонкиСтрока = Формат(НомерКолонки, "ЧГ=0;");
	
	ШаблонАдресаОбласти = НСтр("ru = 'R%1C%2'");
	АдресОбласти = СтрШаблон(ШаблонАдресаОбласти, НомерСтрокиСтрока, НомерКолонкиСтрока);
	
	ОбластьДокумента = ТабличныйДокумент.ПолучитьОбласть(АдресОбласти);
	ЗначениеОбласти = ОбластьДокумента.ТекущаяОбласть.Текст;
	
	Если ТипЗначения = "Число" Тогда
		ЗначениеОбласти = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЗначениеОбласти);
	Иначе
		ЗначениеОбласти = СокрЛП(ЗначениеОбласти);
	КонецЕсли;
	
	Возврат ЗначениеОбласти;
	
КонецФункции

&НаСервере
Функция ПрочитатьТабличныйДокумент(АдресФайла)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	ДанныеФайла.Записать(ИмяВременногоФайла);
	
	Попытка
		ТабличныйДокумент.Прочитать(ИмяВременногоФайла);
	Исключение
		ШаблонОшибки = НСтр("ru = 'Ошибка чтения файла загрузки: %1'");
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Файл");
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		Возврат Истина;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗагрузкиФайлаНаСервер(Результат, АдресФайла, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не ПрочитатьТабличныйДокумент(АдресФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ПерваяСтрока = 12;
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	Объект.ПлатежныеПозицииФинансирование.Очистить();
	
	Для ТекущаяСтрока = ПерваяСтрока По КоличествоСтрок Цикл
		СуммаФинансирования = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 12, "Число");
		Если Не ЗначениеЗаполнено(СуммаФинансирования) Тогда
			Продолжить;
		КонецЕсли;
		
		// Получим дату платежа
		ДатаПлатежа = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 16);
		Если Не ЗначениеЗаполнено(ДатаПлатежа) Тогда
			ДатаПлатежа = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 11);
		КонецЕсли;
		
		ДатаПлатежа = ПолучитьФорматДаты(ДатаПлатежа);
		Если Год(ДатаПлатежа) < 2000 Тогда
			ДатаПлатежа = ДобавитьМесяц(ДатаПлатежа, 2000*12);
		КонецЕсли;
		
		// Получим дату поставки
		ДатаПоставки = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 4);
		Если Не ЗначениеЗаполнено(ДатаПоставки) Тогда
			ДатаПоставки = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 7);
		КонецЕсли;
		
		ДатаПоставки = ПолучитьФорматДаты(ДатаПоставки);
		
		// Получим номер поставки
		НомерПоставки = ПолучитьЗначениеИзТабличногоДокумента(ТабличныйДокумент, ТекущаяСтрока, 3);
		
		НоваяСтрока = Объект.ПлатежныеПозицииФинансирование.Добавить();
		НоваяСтрока.ДатаПлатежа = ДатаПлатежа;
		НоваяСтрока.ДатаПоставки = ДатаПоставки;
		НоваяСтрока.НомерПоставки = НомерПоставки;
		НоваяСтрока.Сумма = СуммаФинансирования;
		НоваяСтрока.СуммаПП = СуммаФинансирования;
	КонецЦикла;
	
	ЗагрузитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcelПромСвязьБанк()
	
	Если Не ЗначениеЗаполнено(Файл) Тогда
		ТекстОшибки = НСтр("ru = 'Укажите путь к файлу!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Файл");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайлаНаСервер", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения, , Файл, Ложь, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcelСбербанк(ТЗ = Неопределено, ЛистЭксель = Неопределено, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт	
	Если Не ЗначениеЗаполнено(Файл) Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Укажите путь к файлу!";
		Сооб.Поле = "Файл";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Файл);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 3;		
	Объект.ПлатежныеПозицииФинансирование.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 10).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииФинансирование.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 15).Value),Символы.НПП,""));  //11
		НоваяСтр.НомерПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 16).Value),Символы.НПП,"")); //12
		
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 11).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 10).Value),Символы.НПП,"")); //6
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 11).Value),Символы.НПП,"")); //7
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 14).Value),Символы.НПП,""));   //10
		НоваяСтр.СуммаПП =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 14).Value),Символы.НПП,"")); //10
		
		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcelСбербанкОстаток(ТЗ = Неопределено, ЛистЭксель = Неопределено, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт	
	Если Не ЗначениеЗаполнено(Файл2) Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Укажите путь к файлу!";
		Сооб.Поле = "Файл";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Файл2);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 7;		
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 5).Value),Символы.НПП,""))) Тогда //6
			НоваяСтр = Объект.ПлатежныеПозицииПеречислениеОстатков.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 14).Value),Символы.НПП,""));  //16
		НоваяСтр.НомерПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 15).Value),Символы.НПП,"")); //18
		
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 16).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 4).Value),Символы.НПП,"")); //7,1
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 5).Value),Символы.НПП,"")); //6,2
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 1).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 13).Value),Символы.НПП,""));   //10,15
		НоваяСтр.СуммаПП =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 13).Value),Символы.НПП,"")); //10,15
		
		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel(ТЗ = Неопределено, ЛистЭксель = Неопределено, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт	
	Если Не ЗначениеЗаполнено(Файл) Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Укажите путь к файлу!";
		Сооб.Поле = "Файл";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Файл);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 12;		
	Объект.ПлатежныеПозицииФинансирование.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииФинансирование.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 16).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 16).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,""));
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 8).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 8).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 15).Value),Символы.НПП,""));
		НоваяСтр.СуммаПП =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 19).Value),Символы.НПП,""));
		
		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel2(ТЗ = Неопределено, ЛистЭксель = Неопределено, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт	
	//подключаемся к эксел
	Если Не ЗначениеЗаполнено(Файл) Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Укажите путь к файлу!";
		Сооб.Поле = "Файл";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Файл);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 5;		
	Объект.ПлатежныеПозицииФинансирование.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 2).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииФинансирование.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 2).Value),Символы.НПП,""));
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 1).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 1).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 6).Value),Символы.НПП,""));
		
		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
КонецПроцедуры

&НаКлиенте
Процедура яяя_ПрочитатьЛистExcel3(ТЗ = Неопределено, ЛистЭксель = Неопределено, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт	
	//подключаемся к эксел
	Если Не ЗначениеЗаполнено(Файл2) Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Укажите путь к файлу!";
		Сооб.Поле = "Файл2";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Файл2);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 11;		
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 13).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииПеречислениеОстатков.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 23).Value),Символы.НПП,"")); // или можно поле 6
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 23).Value),Символы.НПП,""))); // или можно поле 6
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 13).Value),Символы.НПП,""));
		
		
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч,14).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 14).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 22).Value),Символы.НПП,""));
		НоваяСтр.СуммаПП =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,""));  //было 26

		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel3(ТЗ = Неопределено, ЛистЭксель = Неопределено, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт	
	//подключаемся к эксел
	Если Не ЗначениеЗаполнено(Файл2) Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Укажите путь к файлу!";
		Сооб.Поле = "Файл2";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Файл2);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 11;		
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 13).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииПеречислениеОстатков.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 23).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 23).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 13).Value),Символы.НПП,""));
		
		
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч,14).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 14).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 22).Value),Символы.НПП,""));
		НоваяСтр.СуммаПП =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 26).Value),Символы.НПП,""));

		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЛистExcel4(ТЗ = Неопределено, ЛистЭксель = Неопределено, НомерПервойСтроки = 1, НомерПервойКолонки = 1, ВсегоСтрок = 0, ВсегоКолонок = 0) Экспорт	
	//подключаемся к эксел
	Если Не ЗначениеЗаполнено(Файл2) Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Укажите путь к файлу!";
		Сооб.Поле = "Файл2";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Файл2);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Попытка     	
		Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(Объект.ФайлЗагрузки)+" не соответствует необходимому формату! Первый лист не найден!");		
		Возврат;
	КонецПопытки;	
	
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
	Если Версия = "8" тогда
		ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
		ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;	
	
	Сч = 5;		
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();	
	
	Пока Сч<=ФайлСтрок Цикл
		Если ЗначениеЗаполнено(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 2).Value),Символы.НПП,""))) Тогда
			НоваяСтр = Объект.ПлатежныеПозицииПеречислениеОстатков.Добавить();
		Иначе
			Сч=Сч+1;
			Продолжить;
		КонецЕсли;
		
		
		НоваяСтр.ДатаПлатежа = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПлатежа) Тогда
			НоваяСтр.ДатаПлатежа = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 7).Value),Символы.НПП,"")));	
		КонецЕсли;
		Если Год(НоваяСтр.ДатаПлатежа) < 2000 Тогда
			НоваяСтр.ДатаПлатежа = ДобавитьМесяц(НоваяСтр.ДатаПлатежа ,2000*12);
		КонецЕсли;
		НоваяСтр.НомерПоставки = СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 2).Value),Символы.НПП,""));
		НомерПоставки = СтрРазделить(НоваяСтр.НомерПоставки," ",Ложь);
		НоваяСтр.НомерПоставки = НомерПоставки[0];
		
		
		НоваяСтр.ДатаПоставки =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 1).Value),Символы.НПП,""));
		Если Не ЗначениеЗаполнено(НоваяСтр.ДатаПоставки) Тогда
			НоваяСтр.ДатаПоставки = ПолучитьФорматДаты(СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 1).Value),Символы.НПП,"")));	
		КонецЕсли;
		НоваяСтр.Сумма =  СокрЛП(СтрЗаменить(СокрЛП(Excel.Cells(Сч, 6).Value),Символы.НПП,""));
		
		Сч=Сч+1;
	КонецЦикла;	
	Excel.ActiveWorkbook.Close(); 	
	Excel = 0;
	
КонецПроцедуры

&НаКлиенте	
Функция ПолучитьФорматДаты(СтрДата)	
	СтрДата = СокрЛП(СтрЗаменить(Нрег(СтрДата), ".", ""));
	СтрДата = СокрЛП(СтрЗаменить(Нрег(СтрДата), "г", ""));
	Попытка
		Год = Прав(СтрДата, 4);
		Мес = Сред(СтрДата,3,2); 
		День = Лев(СтрДата, 2);
		Дата = Год + Мес + День;
	Исключение
		Сообщить("Ошибочный формат даты !!!");
		Сообщить(СтрДата);
	КонецПопытки;
	Возврат Дата;
КонецФункции

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр						=	"Файл протокола обмена (*.xls*)|*.xls*";
	ДиалогВыбораФайла.Расширение					=	"xlsx";	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	Файл;	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Файл = ДиалогВыбораФайла.ПолноеИмяФайла;				
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Файл2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр						=	"Файл протокола обмена (*.xls*)|*.xls*";
	ДиалогВыбораФайла.Расширение					=	"xlsx";	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	Файл2;	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Файл2 = ДиалогВыбораФайла.ПолноеИмяФайла;				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиРТУпоНомеруИзКупца(НомерПоставки,ДатаПоставки)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК РТУ,
	|	СчетФактураВыданный.Ссылка КАК СчетФактура
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка)
	|			И (СчетФактураВыданный.Проведен)
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.Сакс_НомерИзКупца = &Сакс_НомерИзКупца";
	
	Запрос.УстановитьПараметр("Сакс_НомерИзКупца", НомерПоставки);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДобавитьМесяц(ДатаПоставки, -1)));
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДобавитьМесяц(ДатаПоставки, 1)));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Структура = Новый Структура("РТУ,СчетФактура");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура, ВыборкаДетальныеЗаписи);
		Возврат Структура;
	КонецЦикла;
	
	Возврат Неопределено;	
КонецФункции

&НаСервере
Функция НайтиПоступленияНаРСпоНазначениюПлатежа2(НомерПоставки,ДатаПлатежа,ПеречислениеОстатков = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
	|	ПоступлениеНаРасчетныйСчет.НазначениеПлатежа КАК НазначениеПлатежа
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен
	|	И ПоступлениеНаРасчетныйСчет.ВидОперации = &ВидОперации
	|	И ПоступлениеНаРасчетныйСчет.Контрагент = &Контрагент
	|	И &УсловиеОтбораПоНазначениюПлатежа
	//|	И НАЧАЛОПЕРИОДА(ПоступлениеНаРасчетныйСчет.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата2, МЕСЯЦ)
	|	И ПоступлениеНаРасчетныйСчет.Организация = &Организация";
	
	Если ПеречислениеОстатков Тогда
		НазначениеПлатежа = "%ПЕРЕЧИСЛЕНИЕ ОСТАТКОВ%"+ " "+НомерПоставки+"%"; //06.05.19 добавлен пробел в строку поиска для исключения двойных нахождений номер Репин
		НазначениеПлатежа2 = "%Перевод остатка%"+ " "+НомерПоставки+"%";      //06.05.19добавлен пробел в строку поиска  для исключения двойных нахождений номер Репин
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеОтбораПоНазначениюПлатежа",
		"(ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа 
		|ИЛИ ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа2)" );
		
	Иначе
		НазначениеПлатежа = "%Финансирование%"+ " " +НомерПоставки+"%";//06.05.19добавлен пробел в строку поиска  для исключения двойных нахождений номер Репин
		НазначениеПлатежа2 = "%NN%"+ " " +НомерПоставки+"%";//06.05.19добавлен пробел в строку поиска  для исключения двойных нахождений номер Репин
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеОтбораПоНазначениюПлатежа",
		"(ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа
		|ИЛИ ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа2)" );
	КонецЕсли;
	
	//
	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаОтФакторинговойКомпании);
	Запрос.УстановитьПараметр("Контрагент", Объект.Фактор);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НазначениеПлатежа", НазначениеПлатежа);
	Запрос.УстановитьПараметр("НазначениеПлатежа2", НазначениеПлатежа2);
	Запрос.УстановитьПараметр("Дата", ДатаПлатежа);		
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(ДатаПлатежа)+1);		

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ПоступлениеНаРС = Неопределено;
	Ненайден = Истина; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Сообщить(НомерПоставки + " " + ВыборкаДетальныеЗаписи.Ссылка);
		Ненайден = Ложь;
		Если ПоступлениеНаРС <> Неопределено Тогда
			Сообщить("Для поставки "+НомерПоставки+" найдены несколько документов поступления на расчетный счет!");
			Возврат Неопределено;
		Иначе
			ПоступлениеНаРС = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Если  Ненайден Тогда
		сообщить("Не найдено для поставки: " + НомерПоставки);
	КонецЕсли;	

	Возврат ПоступлениеНаРС;	
КонецФункции

&НаСервере
Функция НайтиПоступленияНаРСпоСуммеПП(НомерПоставки,СуммаПП,ДатаПлатежа,НомерПлатежа,ПеречислениеОстатков = Ложь)
	Запрос = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
	|	ПоступлениеНаРасчетныйСчет.НазначениеПлатежа КАК НазначениеПлатежа
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен
	|	И ПоступлениеНаРасчетныйСчет.ВидОперации = &ВидОперации
	|	И ПоступлениеНаРасчетныйСчет.Контрагент = &Контрагент
	|	И ПоступлениеНаРасчетныйСчет.СуммаДокумента = &СуммаПП
	|	И НАЧАЛОПЕРИОДА(ПоступлениеНаРасчетныйСчет.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И ПоступлениеНаРасчетныйСчет.Организация = &Организация";
	
	Если НомерПлатежа <> "" Тогда
		Текст = СтрЗаменить(Текст,"ПоступлениеНаРасчетныйСчет.СуммаДокумента = &СуммаПП","ПоступлениеНаРасчетныйСчет.НомерВходящегоДокумента = &НомерПлатежа");
	КонецЕсли;
	
	Запрос.Текст = Текст;
	//Если ПеречислениеОстатков Тогда
	//	НазначениеПлатежа = "%ПЕРЕЧИСЛЕНИЕ ОСТАТКОВ%"+НомерПоставки+"%";
	//	НазначениеПлатежа2 = "%Перевод остатка%"+НомерПоставки+"%";
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеОтбораПоНазначениюПлатежа",
	//	"(ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа 
	//	|ИЛИ ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа2)" );
	//	
	//Иначе
	//	НазначениеПлатежа = "%Финансирование%"+НомерПоставки+"%";
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеОтбораПоНазначениюПлатежа", "(ПоступлениеНаРасчетныйСчет.НазначениеПлатежа ПОДОБНО &НазначениеПлатежа)");
	//КонецЕсли;
	
	//
	
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаОтФакторинговойКомпании);
	Запрос.УстановитьПараметр("Контрагент", Объект.Фактор);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НомерПлатежа", НомерПлатежа);
	//Запрос.УстановитьПараметр("НазначениеПлатежа2", НазначениеПлатежа2);
	Запрос.УстановитьПараметр("Дата", ДатаПлатежа);		
	Запрос.УстановитьПараметр("СуммаПП", СуммаПП);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ПоступлениеНаРС = Неопределено;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПоступлениеНаРС <> Неопределено Тогда
			Сообщить("Для поставки "+НомерПоставки+" найдены несколько документов поступления на расчетный счет!");
			Возврат Неопределено;
		Иначе
			ПоступлениеНаРС = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Возврат ПоступлениеНаРС;	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	
	Вариант = ВариантЗагрузкиПоКонтрагенту();
	
	Если Вариант = 1 Тогда		 //Райффайзен
		ПрочитатьЛистExcel();
		ЗагрузитьНаСервере();
	ИначеЕсли Вариант = 2 Тогда	 //Альфа
		ПрочитатьЛистExcel2();
		ЗагрузитьНаСервере();
	ИначеЕсли Вариант = 3 Тогда  //Сбербанк
		ПрочитатьЛистExcelСбербанк();
		ЗагрузитьНаСервере();
	ИначеЕсли Вариант = 4 Тогда  //Промсвязьбанк
		ПрочитатьЛистExcelПромСвязьБанк()		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	Если Объект.Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Не указана Организация!";
		Сооб.Поле = "Организация";
		Сооб.Сообщить();
		Возврат;
	ИначеЕсли Объект.Фактор = Справочники.Контрагенты.ПустаяСсылка() Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Не указана Факторинговая организация!";
		Сооб.Поле = "Фактор";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	Для Каждого  Стр Из  Объект.ПлатежныеПозицииФинансирование Цикл
		Структура = НайтиРТУпоНомеруИзКупца(Стр.НомерПоставки,Стр.ДатаПоставки);
		Если Структура <> Неопределено Тогда
			Стр.РТУ = Структура.РТУ;	
			Стр.СчетФактура = Структура.СчетФактура;
		Иначе
			ЕстьОшибки = Истина;
			Сообщить("Документ реализации " + Стр.НомерПоставки+" от "+Формат(Стр.ДатаПоставки,"ДФ=dd.MM.yyyy")+" не найден!");
		КонецЕсли;
		Если Объект.ПоискПоКомментариям Тогда
			Стр.ПоступлениеРС = НайтиПоступленияНаРСпоНазначениюПлатежа2(Стр.НомерПоставки,Стр.ДатаПлатежа);
		Иначе
			Стр.ПоступлениеРС = НайтиПоступленияНаРСпоСуммеПП(Стр.НомерПоставки,Стр.СуммаПП,Стр.ДатаПлатежа,Стр.НомерПлатежа);
		КонецЕсли;	
	КонецЦикла;
	СтруктураПоискаРТУ = Новый Структура("РТУ",Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	СтруктураПоискаПостНаРС = Новый Структура("ПоступлениеРС",Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка());
	
	Объект.ДокументыОплаты.Очистить();
	
	Для каждого Стр Из Объект.ПлатежныеПозицииФинансирование Цикл
		Если Стр.РТУ = Документы.РеализацияТоваровУслуг.ПустаяСсылка() или
			Стр.ПоступлениеРС = Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка() Тогда
			//сообщить(Стр.НомерПоставки + " не надена реализация");
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект.ДокументыОплаты.Добавить(),Стр);
	КонецЦикла;
	ВрТаб = Объект.ДокументыОплаты.Выгрузить();
	
	ВрТаб.Свернуть("Выбран,ПоступлениеРС,ДатаПлатежа","Сумма");
	//ВрТаб.Свернуть("Выбран,ПоступлениеРС","Сумма");

	Объект.ДокументыОплаты.Очистить();
	Для каждого стр Из ВрТаб Цикл
		Если Стр.Сумма = Стр.ПоступлениеРС.СуммаДокумента Тогда
			ЗаполнитьЗначенияСвойств(Объект.ДокументыОплаты.Добавить(),Стр);
		Иначе
			Сообщить(Строка( Стр.Сумма) +" / " + Строка(Стр.ПоступлениеРС.СуммаДокумента));
		КонецЕсли;
	КонецЦикла;
	ВрТаб = Неопределено;	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить2(Команда)
	//Если ВариантЗагрузкиПоКонтрагенту() = 1 Тогда
	//	ПрочитатьЛистExcel3();
	//Иначе
	//	ПрочитатьЛистExcel4()
	//КонецЕсли;
	
	Вариант = ВариантЗагрузкиПоКонтрагенту();
	Если Вариант = 1 Тогда		 //Райффайзен
		ПрочитатьЛистExcel3();
	ИначеЕсли Вариант = 2 Тогда	 //Альфа
		ПрочитатьЛистExcel4()
	ИначеЕсли Вариант = 3 Тогда  //Сбербанк
		ПрочитатьЛистExcelСбербанкОстаток()	
	КонецЕсли;

	
	Загрузить2НаСервере();
КонецПроцедуры

&НаСервере
Процедура Загрузить2НаСервере()
	Для Каждого  Стр Из  Объект.ПлатежныеПозицииПеречислениеОстатков Цикл
		Структура = НайтиРТУпоНомеруИзКупца(Стр.НомерПоставки,Стр.ДатаПоставки);
		Если Структура <> Неопределено Тогда
			Стр.РТУ = Структура.РТУ;	
			Стр.СчетФактура = Структура.СчетФактура;
		Иначе
			ЕстьОшибки = Истина;
			Сообщить("Документ реализации " + Стр.НомерПоставки+" от "+Формат(Стр.ДатаПоставки,"ДФ=dd.MM.yyyy")+" не найден!");
		КонецЕсли;
		Если Объект.ПоискПоКомментариям Тогда
   			Стр.ПоступлениеРС = НайтиПоступленияНаРСпоНазначениюПлатежа2(Стр.НомерПоставки,Стр.ДатаПлатежа,Истина);
		Иначе	
			Стр.ПоступлениеРС = НайтиПоступленияНаРСпоСуммеПП(Стр.НомерПоставки,Стр.СуммаПП,Стр.ДатаПлатежа,Стр.НомерПлатежа,Истина);
		КонецЕсли;	
	КонецЦикла;	
	Объект.ДокументыОплаты.Очистить();
	
	Для каждого Стр Из Объект.ПлатежныеПозицииПеречислениеОстатков Цикл
		Если Стр.РТУ = Документы.РеализацияТоваровУслуг.ПустаяСсылка() или
			Стр.ПоступлениеРС = Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект.ДокументыОплаты.Добавить(),Стр);
	КонецЦикла;
	ВрТаб = Объект.ДокументыОплаты.Выгрузить();
	
	ВрТаб.Свернуть("Выбран,ПоступлениеРС,ДатаПлатежа","Сумма");
	Объект.ДокументыОплаты.Очистить();
	Для каждого стр Из ВрТаб Цикл
		Если Стр.Сумма = Стр.ПоступлениеРС.СуммаДокумента Тогда
			ЗаполнитьЗначенияСвойств(Объект.ДокументыОплаты.Добавить(),Стр);
		КонецЕсли;
	КонецЦикла;
	ВрТаб = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить("Не указана организация!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Фактор) Тогда
		Сообщить("Не указана факторинговая компания!");
		Возврат;
	КонецЕсли;
	
	Если Объект.ПлатежныеПозицииФинансирование.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоискаРТУ = Новый Структура("РТУ", Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	СтруктураПоискаПостНаРС = Новый Структура("ПоступлениеРС", Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка());
	СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.13");
	СтруктураПоиска = Новый Структура("ПоступлениеРС, ДатаПлатежа");
	
	НачатьТранзакцию();
	
	Попытка
		Для Каждого СтрРеестр Из Объект.ДокументыОплаты Цикл
			Если Не СтрРеестр.Выбран Тогда
				Продолжить;
			КонецЕсли;
			
			Если Ложь Тогда
				ДокОб = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрРеестр);
			ДокОб = СтрРеестр.ПоступлениеРС.ПолучитьОбъект();
			РасшифровкаПлатежа = ДокОб.РасшифровкаПлатежа;
			
			Если РасшифровкаПлатежа.Количество() > 0 Тогда
				мАналитикаБДДС1= РасшифровкаПлатежа[0].АналитикаБДДС1;
				мЦФО = РасшифровкаПлатежа[0].ЦФО;
				мПроект = РасшифровкаПлатежа[0].Проект;
			Иначе
				мАналитикаБДДС1 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
				мЦФО = Справочники.Организации.ПустаяСсылка();
				мПроект = Справочники.Проекты.ПустаяСсылка();
			КонецЕсли;
			
			РасшифровкаПлатежа.Очистить();
			ДанныеИзРеестра = Объект.ПлатежныеПозицииФинансирование.НайтиСтроки(СтруктураПоиска);
			ТЧ.Очистить();
			
			Для Каждого Стр Из ДанныеИзРеестра Цикл
				ЗаполнитьЗначенияСвойств(ТЧ.Добавить(), Стр);
			КонецЦикла;
			
			Если Не ТребуетсяИзменениеДокумента(ТЧ,СтрРеестр.ПоступлениеРС) Тогда
				Сообщить("Переформирован документ "+Строка(СтрРеестр.ПоступлениеРС));
			КонецЕсли;
			
			Для Каждого Стр Из Объект.ПлатежныеПозицииФинансирование.НайтиСтроки(СтруктураПоиска) Цикл
				НоваяСтр = РасшифровкаПлатежа.Добавить();
				НоваяСтр.ДоговорКонтрагента = ДокОб.ДоговорКонтрагента;
				НоваяСтр.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
				НоваяСтр.СуммаПлатежа = Стр.Сумма;
				НоваяСтр.СуммаВзаиморасчетов = НоваяСтр.СуммаПлатежа;
				НоваяСтр.КурсВзаиморасчетов = 1;
				НоваяСтр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;	// НДС не нужен по счету 76.13 //Репин 29/08/2019
				НоваяСтр.СтатьяДвиженияДенежныхСредств = ДокОб.СтатьяДвиженияДенежныхСредств;
				НоваяСтр.КратностьВзаиморасчетов = 1;
				НоваяСтр.КурсНаДатуПриобретенияРеализацииВалюты = 1;
				НоваяСтр.СчетУчетаРасчетовСКонтрагентом = СчетУчетаРасчетовСКонтрагентом;
				НоваяСтр.сакс_ДокументРеализации = Стр.РТУ;
				//НоваяСтр.ДоговорКонтрагента = НайтиДоговор(Стр.РТУ); // Скоков 09.11.2020. Договор заполняется из шаблона назначения платежа
				НоваяСтр.ЦФО = мЦФО;
				НоваяСтр.Проект= мПроект;
				НоваяСтр.АналитикаБДДС1 = мАналитикаБДДС1;
			КонецЦикла;
			
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить(Строка(ДокОб.Ссылка));
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки		
	
КонецПроцедуры

&НаСервере
Функция НайтиДоговор(РТУ)
	
	Контрагент = Рту.Контрагент;
	Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Если      Контрагент.Код = "УХ-000162" Тогда //Агроторг
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054676");
	ИначеЕсли Контрагент.Код = "УХ-000215" Тогда //ГиперГлобус
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054679");
	ИначеЕсли Контрагент.Код = "УХ-000257" Тогда //Копейка-Москва
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054675");
	ИначеЕсли Контрагент.Код = "УХ-000380" Тогда //Перекресток
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054678");
	ИначеЕсли Контрагент.Код = "УХ-000762" Тогда //СладкаяЖизнь
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054677");
	ИначеЕсли Контрагент.Код = "УХ-000181" Тогда //Атак
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-055803");
	ИначеЕсли Контрагент.Код = "УХ-000183" Тогда //Ашан
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054644");
	ИначеЕсли Контрагент.Код = "УХ-004550" Тогда //Метро
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-054680");
	ИначеЕсли Контрагент.Код = "УХ-004559" Тогда //О"КЕЙ
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-057301");
	ИначеЕсли Контрагент.Код = "УХ-025647" Тогда //Лента
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-056556");
	ИначеЕсли Контрагент.Код = "УХ-004486" Тогда //Тандер
		Договор = Справочники.ДоговорыКонтрагентов.НайтиПоКоду("УХ-057302");		
	КонецЕсли;	
	
	Возврат Договор;
	
КонецФункции

&НаСервере
Функция ВариантЗагрузкиПоКонтрагенту()
	Если СтрНайти(Объект.Фактор.Наименование  ,"РАЙФФАЙЗЕНБАНК") > 0 Тогда 
		Возврат 1;
	ИначеЕсли СтрНайти(ВРЕГ(Объект.Фактор.Наименование)  ,"СБЕР") > 0 Тогда 
		Возврат 3;	
	ИначеЕсли СтрНайти(ВРЕГ(Объект.Фактор.Наименование)  ,"ПРОМСВЯЗ") > 0 Тогда 
		Возврат 4;	
	Иначе
		Возврат 2;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();
	Объект.ПлатежныеПозицииФинансирование.Очистить();
	Файл = "";
	Файл2 = "";
КонецПроцедуры

&НаКлиенте
Процедура ФакторПриИзменении(Элемент)
	Объект.ПлатежныеПозицииПеречислениеОстатков.Очистить();
	Объект.ПлатежныеПозицииФинансирование.Очистить();
	Файл = "";
	Файл2 = "";
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить2(Команда)
	Сохранить2НаСервере();
КонецПроцедуры

&НаСервере
Процедура Сохранить2НаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить("Не указана организация!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Фактор) Тогда
		Сообщить("Не указана факторинговая компания!");
		Возврат;
	КонецЕсли;
	
	Если Объект.ПлатежныеПозицииПеречислениеОстатков.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоискаРТУ = Новый Структура("РТУ", Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	СтруктураПоискаПостНаРС = Новый Структура("ПоступлениеРС", Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка());
	СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.13");
	СтруктураПоиска = Новый Структура("ПоступлениеРС, ДатаПлатежа");
	
	НачатьТранзакцию();
	
	Попытка
		Для Каждого СтрРеестр Из Объект.ДокументыОплаты Цикл
			Если Не СтрРеестр.Выбран Тогда
				Продолжить;
			КонецЕсли;
			
			Если Ложь Тогда
				ДокОб = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрРеестр);
			ДокОб = СтрРеестр.ПоступлениеРС.ПолучитьОбъект();
			РасшифровкаПлатежа = ДокОб.РасшифровкаПлатежа;
			
			Если РасшифровкаПлатежа.Количество() > 0 Тогда
				мАналитикаБДДС1= РасшифровкаПлатежа[0].АналитикаБДДС1;
				мЦФО = РасшифровкаПлатежа[0].ЦФО;
				мПроект = РасшифровкаПлатежа[0].Проект;
			Иначе
				мАналитикаБДДС1 = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
				мЦФО = Справочники.Организации.ПустаяСсылка();
				мПроект = Справочники.Проекты.ПустаяСсылка();
			КонецЕсли;
			
			РасшифровкаПлатежа.Очистить();
			ДанныеИзРеестра = Объект.ПлатежныеПозицииПеречислениеОстатков.НайтиСтроки(СтруктураПоиска);
			ТЧ.Очистить();
			
			Для Каждого Стр Из ДанныеИзРеестра Цикл
				ЗаполнитьЗначенияСвойств(ТЧ.Добавить(),Стр);
			КонецЦикла;
			
			Если Не ТребуетсяИзменениеДокумента(ТЧ, СтрРеестр.ПоступлениеРС) Тогда
				Сообщить("Переформирован документ " + Строка(СтрРеестр.ПоступлениеРС));
			КонецЕсли;
			
			Для Каждого Стр Из Объект.ПлатежныеПозицииПеречислениеОстатков.НайтиСтроки(СтруктураПоиска) Цикл
				НоваяСтр = РасшифровкаПлатежа.Добавить();
				НоваяСтр.ДоговорКонтрагента = ДокОб.ДоговорКонтрагента;
				НоваяСтр.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
				НоваяСтр.СуммаПлатежа = Стр.Сумма;
				НоваяСтр.СуммаВзаиморасчетов = НоваяСтр.СуммаПлатежа;
				НоваяСтр.КурсВзаиморасчетов = 1;
				НоваяСтр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС; // НДС не нужен по счету 76.13 //Репин 29/08/2019
				НоваяСтр.СтатьяДвиженияДенежныхСредств = ДокОб.СтатьяДвиженияДенежныхСредств;
				НоваяСтр.КратностьВзаиморасчетов = 1;
				НоваяСтр.КурсНаДатуПриобретенияРеализацииВалюты = 1;
				НоваяСтр.СчетУчетаРасчетовСКонтрагентом = СчетУчетаРасчетовСКонтрагентом;
				НоваяСтр.сакс_ДокументРеализации = Стр.РТУ;
				//НоваяСтр.ДоговорКонтрагента = НайтиДоговор(Стр.РТУ); // Скоков 09.11.2020. Договор заполняется из шаблона назначения платежа
				НоваяСтр.ЦФО = мЦФО;
				НоваяСтр.Проект = мПроект;
				НоваяСтр.АналитикаБДДС1 = мАналитикаБДДС1;	
			КонецЦикла;
			
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить(Строка(ДокОб.Ссылка));
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		//Объект.ПлатежныеПозицииФинансирование.Очистить();
	Исключение
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки		
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяИзменениеДокумента(ДанныеИзРеестра,Документ)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.сакс_ДокументРеализации КАК сакс_ДокументРеализации,
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа
	|ПОМЕСТИТЬ ДанныеИзДокумента
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеИзРеестра.РТУ КАК РТУ,
	|	ДанныеИзРеестра.Сумма КАК Сумма
	|ПОМЕСТИТЬ ДанныеИзРеестра
	|ИЗ
	|	&ДанныеИзРеестра КАК ДанныеИзРеестра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеИзДокумента.сакс_ДокументРеализации КАК сакс_ДокументРеализации,
	|	ДанныеИзДокумента.СуммаПлатежа КАК СуммаПлатежа,
	|	ДанныеИзРеестра.Сумма КАК Сумма
	|ИЗ
	|	ДанныеИзРеестра КАК ДанныеИзРеестра
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеИзДокумента КАК ДанныеИзДокумента
	|		ПО ДанныеИзРеестра.РТУ = ДанныеИзДокумента.сакс_ДокументРеализации
	|ГДЕ
	|	ДанныеИзРеестра.Сумма <> ЕСТЬNULL(ДанныеИзДокумента.СуммаПлатежа, 0)";
	
	Запрос.Параметры.Вставить("Ссылка",Документ);
	Запрос.Параметры.Вставить("ДанныеИзРеестра",ДанныеИзРеестра.Выгрузить(,"РТУ,СУММА"));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	ВыбратьВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьВсеНаСервере()
	Для каждого Стр Из Объект.ДокументыОплаты Цикл
		Стр.Выбран = Истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыбор(Команда)
	ОтменитьВыборНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтменитьВыборНаСервере()
	Для каждого Стр Из Объект.ДокументыОплаты Цикл
		Стр.Выбран = Ложь;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНомераПостуленийНаРС(Команда)	
	ПараметрыФ = Новый Структура();
	Параметрыф.Вставить("Организация",Объект.Организация);
	Параметрыф.Вставить("Контрагент",Объект.Фактор);
	ПараметрыФ.Вставить("ОткудаВызов",Элементы.Группа8.ТекущаяСтраница.Заголовок);
	ОткрытьФормуМодально("ВнешняяОбработка.РаспределениеФакторинга.Форма.ФормаЗагрузкиСоответствия",Параметрыф,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
Если ИмяСобытия = "Загрузка данных" Тогда	
	ТЧ2.Очистить();
	Для каждого стр Из Параметр.Данные Цикл
		ЗаполнитьЗначенияСвойств(ТЧ2.Добавить(),Стр);
	КонецЦикла;
	Если Параметр.ОткудаВызов =  "Финансирование" Тогда
		ОбновитьСписокДокументов("ПлатежныеПозицииФинансирование");
	Иначе
		ОбновитьСписокДокументов("ПлатежныеПозицииПеречислениеОстатков");
	КонецЕсли;
КонецЕсли;
КонецПроцедуры

Процедура ОбновитьСписокДокументов(Таблица)
	
	Если ТЧ2.Количество() > 0 Тогда
		Для каждого Стр Из Объект[Таблица].НайтиСтроки(Новый Структура("ПоступлениеРС",Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка())) Цикл
			Соответствия  = Тч2.НайтиСтроки(Новый Структура("Реализация",Стр.РТУ));
			Если Соответствия.Количество() > 0 Тогда
				 Стр.ПоступлениеРС = Соответствия[0].ПоступлениеРС;
			КонецЕсли;			
		КонецЦикла;
		
		Объект.ДокументыОплаты.Очистить();
		
		Для каждого Стр Из Объект[Таблица] Цикл
			Если Стр.РТУ = Документы.РеализацияТоваровУслуг.ПустаяСсылка() или
				Стр.ПоступлениеРС = Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка() Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Объект.ДокументыОплаты.Добавить(),Стр);
		КонецЦикла;
		ВрТаб = Объект.ДокументыОплаты.Выгрузить();
		
		ВрТаб.Свернуть("Выбран,ПоступлениеРС,ДатаПлатежа","Сумма");
		Объект.ДокументыОплаты.Очистить();
		Для каждого стр Из ВрТаб Цикл
			Если Стр.Сумма = Стр.ПоступлениеРС.СуммаДокумента Тогда
				ЗаполнитьЗначенияСвойств(Объект.ДокументыОплаты.Добавить(),Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	
