&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.Заголовок = "Выберете файл";
	Диалог.Фильтр = "Текстовый файл (*.txt)|*.txt|Текстовый файл (*.txt) |*.txt|";
	Диалог.ПолноеИмяФайла = "";
	Диалог.МножественныйВыбор = Ложь;
	
	Если Диалог.Выбрать() Тогда
		Значение = Диалог.ПолноеИмяФайла;
		Объект.ФайлЗагрузки = Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаРеестра = КонецМесяца(ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименование(Пар)
	
	Возврат Пар.Наименование;

КонецФункции

&НаСервере
Функция ПолучитьЛицевойСчетПомещениеНаименование(Пар)
	
	Возврат Пар.Помещение.Наименование;

КонецФункции

&НаСервере
Функция ПолучитьНомерЛицевогоСчета(Пар)
	
	Возврат Пар.НомерЛицевогоСчета;

КонецФункции

&НаКлиенте
Процедура ВыгрузитьНовая(Команда)
	
	ТекДок = Новый ТекстовыйДокумент();
	ИтЗадолжн = Формат(Объект.Реестр.Итог("Задолженность"), "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
	
	Для каждого Стр Из Объект.Реестр Цикл
		Задолжн = Формат(Стр.Задолженность, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
		НоваяСтрока = "" + Стр.НомерЛицевогоСчета + ";" + Стр.ЛицевойСчетНаименование + ";Сочи," + Стр.ПомещениеНаименование + ";" + Формат(Объект.ДатаРеестра, "ДФ=MMyy") + ";" + Задолжн;
		ТекДок.ДобавитьСтроку(НоваяСтрока);
	КонецЦикла;
	ТекДок.Записать(Объект.ФайлЗагрузки, КодировкаТекста.ANSI);
	Сообщить("Выгрузка завершена");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	ЕСТЬNULL(КУ_ВзаиморасчетыОстатки.СуммаНачисленияОстаток + КУ_ВзаиморасчетыОстатки.СуммаАвансаОстаток + КУ_ВзаиморасчетыОстатки.СуммаПениОстаток, 0) КАК Задолженность,
		|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет.Наименование КАК ЛицевойСчетНаименование,
		|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет.Помещение.Наименование КАК ПомещениеНаименование,
		|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет.НомерЛицевогоСчета КАК НомерЛицевогоСчета
		|ИЗ
		|	РегистрНакопления.КУ_Взаиморасчеты.Остатки(&ДатаРеестра, ) КАК КУ_ВзаиморасчетыОстатки
		|	ГДЕ КУ_ВзаиморасчетыОстатки.ЛицевойСчет <> ЗНАЧЕНИЕ(Справочник.Ку_ЛицевыеСчета.ПустаяСсылка)";
	
	Если ЗначениеЗаполнено(Здание) Тогда
		Запрос.Текст = Запрос.Текст + "И КУ_ВзаиморасчетыОстатки.ЛицевойСчет.Здание В иерархии (&Здание)";
		Запрос.УстановитьПараметр("Здание", Здание);
	КонецЕсли;
	
	ДатаК = Новый Граница(КонецДня(Объект.ДатаРеестра), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ДатаРеестра", ДатаК);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Объект.Реестр.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ВыборкаДетальныеЗаписи.Задолженность = 0 Тогда
			НоваяСтрока = Объект.Реестр.Добавить();
			НоваяСтрока.ЛицевойСчет = ВыборкаДетальныеЗаписи.ЛицевойСчет;
			НоваяСтрока.Задолженность = ВыборкаДетальныеЗаписи.Задолженность;
			НоваяСтрока.ЛицевойСчетНаименование = ВыборкаДетальныеЗаписи.ЛицевойСчетНаименование;
			НоваяСтрока.ПомещениеНаименование = ВыборкаДетальныеЗаписи.ПомещениеНаименование;
			НоваяСтрока.НомерЛицевогоСчета = ВыборкаДетальныеЗаписи.НомерЛицевогоСчета;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура РеестрЛицевойСчетПриИзменении(Элемент)
	
	НоваяСтрока = ЭтаФорма.Элементы.Реестр.ТекущиеДанные;
	НоваяСтрока.ЛицевойСчетНаименование = ПолучитьНаименование(НоваяСтрока.ЛицевойСчет);
	НоваяСтрока.ПомещениеНаименование = ПолучитьЛицевойСчетПомещениеНаименование(НоваяСтрока.ЛицевойСчет);
	НоваяСтрока.НомерЛицевогоСчета = ПолучитьНомерЛицевогоСчета(НоваяСтрока.ЛицевойСчет);
	
КонецПроцедуры