
&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
		 
	Режим = РежимДиалогаВыбораФайла.Открытие;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.Заголовок = "Выберете файл";
	Диалог.Фильтр = "Текстовый файл (*.txt)|*.txt|Текстовый файл (*.txt) |*.txt|";
	Диалог.ПолноеИмяФайла = "";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "C:\";
	Если Диалог.Выбрать() Тогда
		Значение = Диалог.ПолноеИмяФайла;
		Объект.ФайлЗагрузки = Значение;
	КонецЕсли;
	 
 КонецПроцедуры

&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаРеестра=КонецМесяца(ТекущаяДата());   
	 
 КонецПроцедуры

 
 

//&НаСервере
//Процедура ВыгрузитьНаСервере()
//	 ТекДок = Новый ТекстовыйДокумент();
//	 ТекДок.Прочитать(Объект.ФайлЗагрузки);
//	 ТекДок.Очистить();
//	 //ИтЗадолжн=""+Строка(Формат(Цел(Реестр.Итог("Задолженность")),"ЧЦ=15; ЧГ="))+"."+Прав(Строка(Реестр.Итог("Задолженность")),2);
//	 ИтЗадолжн=Формат(Объект.Реестр.Итог("Задолженность"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
//	 НоваяСтрока="#FILESUM "+ИтЗадолжн;
//	 ТекДок.ДобавитьСтроку(НоваяСтрока);
//	 НоваяСтрока=" #TYPE 7";
//	 ТекДок.ДобавитьСтроку(НоваяСтрока);
//	 НоваяСтрока="#SERVICE 18510";
//	 ТекДок.ДобавитьСтроку(НоваяСтрока);	
//	 НоваяСтрока="#NOTE ООО УК Парк Горького";
//	 ТекДок.ДобавитьСтроку(НоваяСтрока);	
//	 Для каждого Стр Из Объект.Реестр Цикл
//		 Задолжн=Формат(Стр.Задолженность,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
//		 НоваяСтрока=Стр.ЛицевойСчет.Наименование+";Сочи,"+Стр.ЛицевойСчет.Помещение.Наименование+";"+Стр.ЛицевойСчет.НомерЛицевогоСчета+";"+Задолжн+";"+";"+";"+";";
//		 ТекДок.ДобавитьСтроку(НоваяСтрока);	
//	 КонецЦикла;
//	 ТекДок.Записать(Объект.ФайлЗагрузки,КодировкаТекста.ANSI);
//	 Сообщить("Выгрузка завершена");
// 
//	
// КонецПроцедуры

 &НаСервере 
Функция ПолучитьНаименование(Пар) 
возврат Пар.Наименование; 
КонецФункции 

&НаСервере 
Функция ПолучитьЛицевойСчетПомещениеНаименование(Пар) 
возврат Пар.Помещение.Наименование; 
КонецФункции

&НаСервере 
Функция ПолучитьНомерЛицевогоСчета(Пар) 
возврат Пар.НомерЛицевогоСчета; 
КонецФункции


&НаКлиенте
 Процедура Выгрузить(Команда)
	 //ВыгрузитьНаСервере();
	 ТекДок = Новый ТекстовыйДокумент();
	 ТекДок.Прочитать(Объект.ФайлЗагрузки);
	 ТекДок.Очистить();
	 //ИтЗадолжн=""+Строка(Формат(Цел(Реестр.Итог("Задолженность")),"ЧЦ=15; ЧГ="))+"."+Прав(Строка(Реестр.Итог("Задолженность")),2);
	 ИтЗадолжн=Формат(Объект.Реестр.Итог("Задолженность"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
	 НоваяСтрока="#FILESUM "+ИтЗадолжн;
	 ТекДок.ДобавитьСтроку(НоваяСтрока);
	 НоваяСтрока=" #TYPE 7";
	 ТекДок.ДобавитьСтроку(НоваяСтрока);
	 НоваяСтрока="#SERVICE 18510";
	 ТекДок.ДобавитьСтроку(НоваяСтрока);	
	 НоваяСтрока="#NOTE ООО УК Парк Горького";
	 ТекДок.ДобавитьСтроку(НоваяСтрока);	
	 Для каждого Стр Из Объект.Реестр Цикл
		 Задолжн=Формат(Стр.Задолженность,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
		 НоваяСтрока=ПолучитьНаименование(Стр.ЛицевойСчет)+";Сочи,"+ПолучитьЛицевойСчетПомещениеНаименование(Стр.ЛицевойСчет)+";"+ПолучитьНомерЛицевогоСчета(Стр.ЛицевойСчет)+";"+Задолжн+";"+";"+";"+";";
		 ТекДок.ДобавитьСтроку(НоваяСтрока);	
		 ОбработкаПрерыванияПользователя();
	 КонецЦикла;
	 ТекДок.Записать(Объект.ФайлЗагрузки,КодировкаТекста.ANSI);
	 Сообщить("Выгрузка завершена");
  КонецПроцедуры

  &НаКлиенте
Процедура ВыгрузитьНовая(Команда)
	  
	  //ВыгрузитьНаСервере();
	 ТекДок = Новый ТекстовыйДокумент();
	 ////ТекДок.Прочитать(Объект.ФайлЗагрузки);
	 ////ТекДок.Очистить();
	 ////ИтЗадолжн=""+Строка(Формат(Цел(Реестр.Итог("Задолженность")),"ЧЦ=15; ЧГ="))+"."+Прав(Строка(Реестр.Итог("Задолженность")),2);
	 ИтЗадолжн=Формат(Объект.Реестр.Итог("Задолженность"),"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
	 //НоваяСтрока="#FILESUM "+ИтЗадолжн;
	 //ТекДок.ДобавитьСтроку(НоваяСтрока);
	 //НоваяСтрока="#TYPE 7";
	 //ТекДок.ДобавитьСтроку(НоваяСтрока);
	 //НоваяСтрока="#SERVICE 18510";
	 //ТекДок.ДобавитьСтроку(НоваяСтрока);	
	 //НоваяСтрока="#NOTE ООО УК Парк Горького";
	 //ТекДок.ДобавитьСтроку(НоваяСтрока);	
	 Для каждого Стр Из Объект.Реестр Цикл
		 Задолжн = Формат(Стр.Задолженность,"ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ="); 
		 //НоваяСтрока = Стр.ЛицевойСчетНаименование+";Сочи,"+Стр.ПомещениеНаименование+";"+Стр.НомерЛицевогоСчета+";"+Задолжн+";"+";"+";"+";";
		 
		 //Лицевой счет;ФИО;Адрес;Период оплаты;Сумма начислений
		 НоваяСтрока = ""+Стр.НомерЛицевогоСчета+";"+Стр.ЛицевойСчетНаименование+";Сочи,"+Стр.ПомещениеНаименование+";"+Формат(Объект.ДатаРеестра,"ДФ=MMyy")+";"+Задолжн;
		 ТекДок.ДобавитьСтроку(НоваяСтрока);	
	 КонецЦикла;
	 ТекДок.Записать(Объект.ФайлЗагрузки,КодировкаТекста.ANSI);
	 Сообщить("Выгрузка завершена");
	 
КонецПроцедуры

 
&НаСервере
Процедура ЗаполнитьНаСервере()
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет,
	|	ЕСТЬNULL(КУ_ВзаиморасчетыОстатки.СуммаНачисленияОстаток + КУ_ВзаиморасчетыОстатки.СуммаАвансаОстаток + КУ_ВзаиморасчетыОстатки.СуммаПениОстаток, 0) КАК Задолженность,
	|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет.Наименование КАК ЛицевойСчетНаименование,
	|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет.Помещение.Наименование КАК ПомещениеНаименование,
	|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет.НомерЛицевогоСчета КАК НомерЛицевогоСчета
	|ИЗ
	|	РегистрНакопления.КУ_Взаиморасчеты.Остатки(&ДатаРеестра, ) КАК КУ_ВзаиморасчетыОстатки
	/////////
	|	ГДЕ КУ_ВзаиморасчетыОстатки.ЛицевойСчет <> ЗНАЧЕНИЕ(Справочник.Ку_ЛицевыеСчета.ПустаяСсылка)"; //САКС Антипова 12.02.20 110508
	Если ЗначениеЗаполнено(Здание) тогда
		Запрос.Текст = Запрос.Текст + "И КУ_ВзаиморасчетыОстатки.ЛицевойСчет.Здание В иерархии (&Здание)";
		Запрос.УстановитьПараметр("Здание",Здание);
	КонецЕсли;
	
	
	ДатаК = Новый Граница(КонецДня(Объект.ДатаРеестра), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ДатаРеестра", ДатаК);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Объект.Реестр.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ВыборкаДетальныеЗаписи.Задолженность = 0 Тогда
			НоваяСтрока 						= Объект.Реестр.Добавить();
			НоваяСтрока.ЛицевойСчет				= ВыборкаДетальныеЗаписи.ЛицевойСчет;
			НоваяСтрока.Задолженность			= ВыборкаДетальныеЗаписи.Задолженность;
			НоваяСтрока.ЛицевойСчетНаименование	= ВыборкаДетальныеЗаписи.ЛицевойСчетНаименование;
			НоваяСтрока.ПомещениеНаименование	= ВыборкаДетальныеЗаписи.ПомещениеНаименование;
			НоваяСтрока.НомерЛицевогоСчета		= ВыборкаДетальныеЗаписи.НомерЛицевогоСчета;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура РеестрЛицевойСчетПриИзменении(Элемент)
	
	НоваяСтрока = ЭтаФорма.Элементы.Реестр.ТекущиеДанные;	
	
	НоваяСтрока.ЛицевойСчетНаименование	= ПолучитьНаименование(НоваяСтрока.ЛицевойСчет);
	НоваяСтрока.ПомещениеНаименование	= ПолучитьЛицевойСчетПомещениеНаименование(НоваяСтрока.ЛицевойСчет);
	НоваяСтрока.НомерЛицевогоСчета		= ПолучитьНомерЛицевогоСчета(НоваяСтрока.ЛицевойСчет);
	
КонецПроцедуры



