#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаРеестра = КонецМесяца(ТекущаяДатаСеанса());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НастройкиДиалога = Новый Структура;
	НастройкиДиалога.Вставить("Заголовок", НСтр("ru = 'Выберите файл'"));
	НастройкиДиалога.Вставить("Фильтр", "txt (*.txt)|*.txt");
	
	ОбменДаннымиКлиент.ОбработчикВыбораФайла(ЭтотОбъект, "ИмяФайлаВыгрузки", СтандартнаяОбработка, НастройкиДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПроверитьСуществованиеФайла() Тогда
		ЗапуститьПриложение(ИмяФайлаВыгрузки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеестр

&НаКлиенте
Процедура РеестрЛицевойСчетПриИзменении(Элемент)
	
	НоваяСтрока = ЭтаФорма.Элементы.Реестр.ТекущиеДанные;
	НоваяСтрока.ЛицевойСчетНаименование = ПолучитьНаименование(НоваяСтрока.ЛицевойСчет);
	НоваяСтрока.ПомещениеНаименование = ПолучитьЛицевойСчетПомещениеНаименование(НоваяСтрока.ЛицевойСчет);
	НоваяСтрока.НомерЛицевогоСчета = ПолучитьНомерЛицевогоСчета(НоваяСтрока.ЛицевойСчет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНовая(Команда)
	
	ТекДок = Новый ТекстовыйДокумент();
	ИтЗадолжн = Формат(Объект.Реестр.Итог("Задолженность"), "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
	
	Для каждого Стр Из Объект.Реестр Цикл
		Задолжн = Формат(Стр.Задолженность, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=");
		НоваяСтрока = "" + Стр.НомерЛицевогоСчета + ";" + Стр.ЛицевойСчетНаименование + ";Сочи," + Стр.ПомещениеНаименование + ";" + Формат(Объект.ДатаРеестра, "ДФ=MMyy") + ";" + Задолжн;
		ТекДок.ДобавитьСтроку(НоваяСтрока);
	КонецЦикла;
	ТекДок.Записать(ИмяФайлаВыгрузки, КодировкаТекста.ANSI);
	Сообщить("Выгрузка завершена");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПроверитьСуществованиеФайла()
	
	СтандартнаяОбработка = Ложь;
	Если ПустаяСтрока(ИмяФайлаВыгрузки) Тогда
		ТекстОшибки = НСтр("ru = 'Не указано имя файла выгрузки!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ИмяФайлаВыгрузки");
		Возврат Ложь;
	КонецЕсли;
	
	Файл = Новый Файл(ИмяФайлаВыгрузки);
	Если Не Файл.Существует() Тогда
		ТекстОшибки = НСтр("ru = 'Указанный файл выгрузки не существует!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ИмяФайлаВыгрузки");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	ЕСТЬNULL(КУ_ВзаиморасчетыОстатки.СуммаНачисленияОстаток + КУ_ВзаиморасчетыОстатки.СуммаАвансаОстаток + КУ_ВзаиморасчетыОстатки.СуммаПениОстаток, 0) КАК Задолженность,
		|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет.Наименование КАК ЛицевойСчетНаименование,
		|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет.Помещение.Наименование КАК ПомещениеНаименование,
		|	КУ_ВзаиморасчетыОстатки.ЛицевойСчет.НомерЛицевогоСчета КАК НомерЛицевогоСчета
		|ИЗ
		|	РегистрНакопления.КУ_Взаиморасчеты.Остатки(&ДатаРеестра, ) КАК КУ_ВзаиморасчетыОстатки
		|	ГДЕ КУ_ВзаиморасчетыОстатки.ЛицевойСчет <> ЗНАЧЕНИЕ(Справочник.Ку_ЛицевыеСчета.ПустаяСсылка)";
	
	Если ЗначениеЗаполнено(Здание) Тогда
		Запрос.Текст = Запрос.Текст + "И КУ_ВзаиморасчетыОстатки.ЛицевойСчет.Здание В иерархии (&Здание)";
		Запрос.УстановитьПараметр("Здание", Здание);
	КонецЕсли;
	
	ДатаК = Новый Граница(КонецДня(Объект.ДатаРеестра), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ДатаРеестра", ДатаК);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Объект.Реестр.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ВыборкаДетальныеЗаписи.Задолженность = 0 Тогда
			НоваяСтрока = Объект.Реестр.Добавить();
			НоваяСтрока.ЛицевойСчет = ВыборкаДетальныеЗаписи.ЛицевойСчет;
			НоваяСтрока.Задолженность = ВыборкаДетальныеЗаписи.Задолженность;
			НоваяСтрока.ЛицевойСчетНаименование = ВыборкаДетальныеЗаписи.ЛицевойСчетНаименование;
			НоваяСтрока.ПомещениеНаименование = ВыборкаДетальныеЗаписи.ПомещениеНаименование;
			НоваяСтрока.НомерЛицевогоСчета = ВыборкаДетальныеЗаписи.НомерЛицевогоСчета;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименование(Пар)
	
	Возврат Пар.Наименование;

КонецФункции

&НаСервере
Функция ПолучитьЛицевойСчетПомещениеНаименование(Пар)
	
	Возврат Пар.Помещение.Наименование;

КонецФункции

&НаСервере
Функция ПолучитьНомерЛицевогоСчета(Пар)
	
	Возврат Пар.НомерЛицевогоСчета;

КонецФункции

#КонецОбласти