
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Организация") Тогда
		Объект.Организация = Параметры.Организация;
		Объект.Фактор = Параметры.Контрагент;
		ОткудаВызов = Параметры.ОткудаВызов;
	КонецЕсли;
	
	
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);	
	
	
	Область = ТабличныйДокумент.Область(1,1,1,1);
	Область.Текст = "Номер поступления на Р/с";
	Область.Обвести(Линия,Линия,Линия,Линия);
	Область.ШиринаКолонки = 20;
	
	Область = ТабличныйДокумент.Область(1,2,1,2);
	Область.Текст = "Дата платежа";
	Область.ШиринаКолонки = 20;
	Область.Обвести(Линия,Линия,Линия,Линия);
	
	Область = ТабличныйДокумент.Область(1,3,1,3);
	Область .Текст = "Номер поставки";
	Область.ШиринаКолонки = 20;
	Область.Обвести(Линия,Линия,Линия,Линия);
	
	Область = ТабличныйДокумент.Область(1,4,1,4);
	Область .Текст = "Дата поставки";
	Область.ШиринаКолонки = 20;
	Область.Обвести(Линия,Линия,Линия,Линия);
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
	ПараметрыФ = Новый Структура;
	ПараметрыФ.Вставить("Данные",ТЧ);
	ПараметрыФ.Вставить("ОткудаВызов",ОткудаВызов);
	
	Оповестить("Загрузка данных",ПараметрыФ,ЭтаФорма);
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	Для Стр = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		НомерПоступленияНаРС = ТабличныйДокумент.Область(Стр,1,Стр,1).Текст;
		
		Дата = ТабличныйДокумент.Область(Стр,2,Стр,2).Текст; 
		ДатаПоступленияНаРС = ПолучитьДатуИзСтроки(Дата);
		НомерПоставки = ТабличныйДокумент.Область(Стр,3,Стр,3).Текст;
		
		Дата = ТабличныйДокумент.Область(Стр,4,Стр,4).Текст;
		ДатаПоставки = ПолучитьДатуИзСтроки(Дата); 
		ПоступлениеРС = ПолучитьНомерПоступленияНаРС(НомерПоступленияНаРС,ДатаПоступленияНаРС);
		Ошибка = Ложь;
		Если ПоступлениеРС = Неопределено Тогда
			Сообщить("Поступление "+НомерПоступленияНаРС+ " от " + Формат(ДатаПоступленияНаРС,"ДФ=dd.MM.yyyy") + " не найдено!");
		Ошибка = Истина;
		КонецЕсли;
		Поставка = НайтиРТУпоНомеруИзКупца(НомерПоставки,ДатаПоставки);
		Если Поставка = Неопределено Тогда
			Сообщить("Документ реализации "+НомерПоставки+ " от " + Формат(ДатаПоставки,"ДФ=dd.MM.yyyy") + " не найден!");
			Ошибка = Истина;
		КонецЕсли;	
		Если Ошибка Тогда
		Продолжить;
		КонецЕсли;
		НСтр = ТЧ.Добавить();
		НСтр.ПоступлениеРС = ПоступлениеРС;
		НСтр.Реализация = Поставка.РТУ;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьНомерПоступленияНаРС(Номер,Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.Проведен
	|	И ПоступлениеНаРасчетныйСчет.Организация = &Организация
	|	И ПоступлениеНаРасчетныйСчет.Контрагент = &Контрагент
	|	И ПоступлениеНаРасчетныйСчет.Номер = &Номер
	|	И НАЧАЛОПЕРИОДА(ПоступлениеНаРасчетныйСчет.Дата, ДЕНЬ) = &Дата
	|	И ПоступлениеНаРасчетныйСчет.ВидОперации = &ВидОперации";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаОтФакторинговойКомпании);
	Запрос.УстановитьПараметр("Контрагент", Объект.Фактор);
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция НайтиРТУпоНомеруИзКупца(НомерПоставки,ДатаПоставки)
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК РТУ,
	|	СчетФактураВыданный.Ссылка КАК СчетФактура
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка)
	|			И (СчетФактураВыданный.Проведен)
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Сакс_НомерИзКупца = &Сакс_НомерИзКупца
	|	И НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Сакс_НомерИзКупца", НомерПоставки);
	Запрос.УстановитьПараметр("Дата", ДатаПоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Структура = Новый Структура("РТУ,СчетФактура");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Структура, ВыборкаДетальныеЗаписи);
		Возврат Структура;
	КонецЦикла;
	Возврат Неопределено;	
КонецФункции

Функция ПолучитьДатуИзСтроки(Стр) 
	Д = Дата("00010101000000");
	
	Если ПустаяСтрока(Стр) Тогда
		Возврат Д;
	КонецЕсли;
	
	Если Найти(Стр,".") > 0 Тогда
		
		Если Найти(Стр,":") > 0 И Найти(Стр," ") > 0 Тогда 
			М = СтрРазделить(Стр," ");
			Возврат ПолучитьДатуИзСтроки(М[0]);
		КонецЕсли;
		М = СтрРазделить(Стр,".");
		
	ИначеЕсли Найти(Стр,"/")>0 Тогда
		
		М = СтрРазделить(Стр,"/");
		
	ИначеЕсли Найти(Стр,",")>0 Тогда
		
		М = СтрРазделить(Стр,",");
		
	ИначеЕсли Найти(Стр,"-")>0 Тогда
		
		М = СтрРазделить(Стр,"-");
		
	КонецЕсли; 
	
	Попытка
		
		Если М.Количество() = 3 Тогда //"01.02.13" или "01.02.2013"
			Год = ?(СтрДлина(М[2]) = 2,2000 + М[2],М[2]);
			Д = Дата(Год,М[1],М[0]);
		ИначеЕсли М.Количество() = 2 Тогда //"02.13" или "02.2013";
			Год = ?(СтрДлина(М[1]) = 2,2000 + М[1],М[1]);
			Д = Дата(Год,М[0],1);
		КонецЕсли;
		
	Исключение
	КонецПопытки; 
	
	Возврат Д; 
	
КонецФункции




